# Tema: Paquete Pandas

In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

## Series

In [2]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [4]:
obj2['a']

-5

In [5]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [6]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2*3

d    12
b    21
a   -15
c     9
dtype: int64

In [9]:
'b' in obj2

True

In [10]:
'e' in obj2

False

In [11]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [12]:
obj3['Utah']

5000

In [13]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [14]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [15]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [16]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [17]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [18]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrame

In [19]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [20]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [21]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [22]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [23]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [24]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [25]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [26]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [27]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   0.0    True
two    2001    Ohio  1.7   1.0    True
three  2002    Ohio  3.6   2.0    True
four   2001  Nevada  2.4   3.0   False
five   2002  Nevada  2.9   4.0   False

In [28]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [29]:
frame3=frame2.T
frame3

        one   two three    four    five
year   2000  2001  2002    2001    2002
state  Ohio  Ohio  Ohio  Nevada  Nevada
pop     1.5   1.7   3.6     2.4     2.9
debt      0     1     2       3       4

In [30]:
frame3["two"]

year     2001
state    Ohio
pop       1.7
debt        1
Name: two, dtype: object

In [31]:
'Ohio' in frame2.columns

False

In [32]:
'year' in frame3.index

True

## Métodos del objeto Index

## Reindizar : reindex

In [33]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [34]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [35]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [36]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [37]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

### Sacar una columna

In [38]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [39]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [40]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [41]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [42]:
frame2.drop(['four','two'])

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
three  2002    Ohio  3.6   2.0
five   2002  Nevada  2.9   4.0

In [43]:
frame2[2:4]

       year   state  pop  debt
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0

In [44]:
frame2[['year','pop']]

       year  pop
one    2000  1.5
two    2001  1.7
three  2002  3.6
four   2001  2.4
five   2002  2.9

In [45]:
frame2['one':'three']

       year state  pop  debt
one    2000  Ohio  1.5   0.0
two    2001  Ohio  1.7   1.0
three  2002  Ohio  3.6   2.0

In [46]:
frame2[:2]

     year state  pop  debt
one  2000  Ohio  1.5   0.0
two  2001  Ohio  1.7   1.0

In [47]:
frame2[2:]

       year   state  pop  debt
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [48]:
frame2[-2:]

      year   state  pop  debt
four  2001  Nevada  2.4   3.0
five  2002  Nevada  2.9   4.0

In [49]:
frame2[:-2]

       year state  pop  debt
one    2000  Ohio  1.5   0.0
two    2001  Ohio  1.7   1.0
three  2002  Ohio  3.6   2.0

In [50]:
frame2['pop']<2

one       True
two       True
three    False
four     False
five     False
Name: pop, dtype: bool

In [51]:
frame2[frame2['pop']<2]

     year state  pop  debt
one  2000  Ohio  1.5   0.0
two  2001  Ohio  1.7   1.0

In [52]:
frame2[frame2.state=='Ohio']

       year state  pop  debt
one    2000  Ohio  1.5   0.0
two    2001  Ohio  1.7   1.0
three  2002  Ohio  3.6   2.0

In [53]:
frame2[frame2.state=='Ohio'][-2:]

       year state  pop  debt
two    2001  Ohio  1.7   1.0
three  2002  Ohio  3.6   2.0

### Aritmética y alineación de datos

In [54]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])         
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [55]:
s1+s2      ##Suma de series, los campos que no coinciden los índices de completan con NaN ="Not a Number"

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [56]:
df1 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('bcdef'),index=['Ohio', 'Texas', 'Colorado','Kansas'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1+df2

             b   c     d     e   f
Colorado   NaN NaN   NaN   NaN NaN
Kansas     NaN NaN   NaN   NaN NaN
Ohio       3.0 NaN   6.0   8.0 NaN
Oregon     NaN NaN   NaN   NaN NaN
Texas     11.0 NaN  14.0  16.0 NaN
Utah       NaN NaN   NaN   NaN NaN

In [57]:
df1.add(df2, fill_value=0)

             b     c     d     e     f
Colorado  10.0  11.0  12.0  13.0  14.0
Kansas    15.0  16.0  17.0  18.0  19.0
Ohio       3.0   1.0   6.0   8.0   4.0
Oregon     9.0   NaN  10.0  11.0   NaN
Texas     11.0   6.0  14.0  16.0   9.0
Utah       0.0   NaN   1.0   2.0   NaN

![image.png](attachment:image.png)

### Aplicación de funciones y mapeo

In [58]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.108632  1.424732 -1.246154
Ohio    0.153277  0.432689  0.937716
Texas   0.604738 -1.030168 -0.195807
Oregon -0.659442 -0.061341 -0.221033

In [59]:
np.abs(frame)

               b         d         e
Utah    0.108632  1.424732  1.246154
Ohio    0.153277  0.432689  0.937716
Texas   0.604738  1.030168  0.195807
Oregon  0.659442  0.061341  0.221033

In [60]:
f = lambda x: x.max() - x.min()      ##Funcion a ser aplicada a las columnas de frame

In [61]:
frame.apply(f)

b    1.264179
d    2.454900
e    2.183870
dtype: float64

In [62]:
frame.apply(f, axis=1)

Utah      2.670886
Ohio      0.784440
Texas     1.634906
Oregon    0.598101
dtype: float64

In [63]:
format = lambda x: '%.2f' % x

In [64]:
frame.applymap(format)

            b      d      e
Utah    -0.11   1.42  -1.25
Ohio     0.15   0.43   0.94
Texas    0.60  -1.03  -0.20
Oregon  -0.66  -0.06  -0.22

In [65]:
frame['e'].map(format)

Utah      -1.25
Ohio       0.94
Texas     -0.20
Oregon    -0.22
Name: e, dtype: object

## Orden y rango

In [66]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [67]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [68]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [69]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [70]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [71]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [72]:
obj = Series([4, 7, -3, 2])   ## Con las serie
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [73]:
obj.sort_index()          ##Para ordenar por indices

0    4
1    7
2   -3
3    2
dtype: int64

In [74]:
obj.sort_values()         ##Para ordenar los valores

2   -3
3    2
0    4
1    7
dtype: int64

In [75]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})    ##DataFrame
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [76]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [77]:
frame.sort_index()

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [78]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  1.179927 -0.320088 -0.323091
a  1.248043 -0.370797  0.473959
b  0.921409  0.302229 -1.161635
b -0.015539 -0.213536 -0.359591

In [79]:
df.loc['b']

          0         1         2
b  0.921409  0.302229 -1.161635
b -0.015539 -0.213536 -0.359591

In [80]:
df.index.is_unique

False

## Computo de Estadística Descriptiva

In [81]:
df.sum()                      ##Cálculo por columnas

0    3.333841
1   -0.602192
2   -1.370359
dtype: float64

In [82]:
df.sum(axis=1)                ##Cálculo por filas

a    0.536748
a    1.351205
b    0.062003
b   -0.588666
dtype: float64

In [83]:
df.mean(axis=1, skipna=False)     ## skipna=True excluye valores faltantes

a    0.178916
a    0.450402
b    0.020668
b   -0.196222
dtype: float64

In [84]:
df.describe()      ##Estadística descriptiva por columnas

              0         1         2
count  4.000000  4.000000  4.000000
mean   0.833460 -0.150548 -0.342590
std    0.583224  0.308884  0.667896
min   -0.015539 -0.370797 -1.161635
25%    0.687172 -0.332765 -0.560102
50%    1.050668 -0.266812 -0.341341
75%    1.196956 -0.084595 -0.123829
max    1.248043  0.302229  0.473959

![image.png](attachment:image.png)

## Correlación y Covarianza

In [85]:
df.cov()

          0         1         2
0  0.340151 -0.018918  0.095894
1 -0.018918  0.095409 -0.184308
2  0.095894 -0.184308  0.446085

In [86]:
df.corrwith(df[1])

0   -0.105011
1    1.000000
2   -0.893387
dtype: float64

## Manejo de datos faltantes

In [87]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [88]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [89]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

![image.png](attachment:image.png)

In [90]:
from numpy import nan as NA

In [91]:
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [92]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [93]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [94]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [95]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [96]:
data[4] = NA
print(data)
data.dropna(axis=1, how='all')

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [97]:
data.fillna(0)

     0    1    2    4
0  1.0  6.5  3.0  0.0
1  1.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  0.0  6.5  3.0  0.0

In [98]:
data.fillna({1: 0.5, 4: -1})

     0    1    2    4
0  1.0  6.5  3.0 -1.0
1  1.0  0.5  NaN -1.0
2  NaN  0.5  NaN -1.0
3  NaN  6.5  3.0 -1.0

In [99]:
df = DataFrame(np.random.randn(6, 3))
df

          0         1         2
0 -0.126057 -0.431769 -0.190977
1 -1.076069  0.067296  2.288929
2  0.833015 -0.518569 -0.525300
3  0.082938  0.281941 -1.130804
4  0.351682  0.659401  2.152261
5  1.128856 -2.856407 -0.031598

In [100]:
df.loc[2:, 1] = NA; df.loc[4:, 2] = NA

In [101]:
df

          0         1         2
0 -0.126057 -0.431769 -0.190977
1 -1.076069  0.067296  2.288929
2  0.833015       NaN -0.525300
3  0.082938       NaN -1.130804
4  0.351682       NaN       NaN
5  1.128856       NaN       NaN

In [102]:
df.fillna(method='ffill')

          0         1         2
0 -0.126057 -0.431769 -0.190977
1 -1.076069  0.067296  2.288929
2  0.833015  0.067296 -0.525300
3  0.082938  0.067296 -1.130804
4  0.351682  0.067296 -1.130804
5  1.128856  0.067296 -1.130804

In [103]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.126057 -0.431769 -0.190977
1 -1.076069  0.067296  2.288929
2  0.833015  0.067296 -0.525300
3  0.082938  0.067296 -1.130804
4  0.351682       NaN -1.130804
5  1.128856       NaN -1.130804

In [104]:
data = Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [105]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

![image.png](attachment:image.png)

## Indexación jerárquica

In [106]:
data = Series(np.random.randn(10),index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],[1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1   -1.178928
   2    0.684093
   3    0.117859
b  1   -1.007366
   2    0.125691
   3   -0.837341
c  1   -0.907840
   2    1.541062
d  2    1.083661
   3    0.792978
dtype: float64

In [107]:
data['b']

1   -1.007366
2    0.125691
3   -0.837341
dtype: float64

In [108]:
data['b':'c']

b  1   -1.007366
   2    0.125691
   3   -0.837341
c  1   -0.907840
   2    1.541062
dtype: float64

In [109]:
data.unstack()

          1         2         3
a -1.178928  0.684093  0.117859
b -1.007366  0.125691 -0.837341
c -0.907840  1.541062       NaN
d       NaN  1.083661  0.792978

In [110]:
data.unstack().stack()

a  1   -1.178928
   2    0.684093
   3    0.117859
b  1   -1.007366
   2    0.125691
   3   -0.837341
c  1   -0.907840
   2    1.541062
d  2    1.083661
   3    0.792978
dtype: float64

In [111]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
    columns=[['Ohio', 'Ohio', 'Colorado'],
    ['Green', 'Red', 'Green']])

In [112]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [113]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [114]:
frame.loc['a']

state  Ohio     Colorado
color Green Red    Green
key2
1         0   1        2
2         3   4        5

In [115]:
frame[['Ohio']]

state      Ohio
color     Green Red
key1 key2
a    1        0   1
     2        3   4
b    1        6   7
     2        9  10

In [116]:
frame.describe()

state      Ohio              Colorado
color     Green        Red      Green
count  4.000000   4.000000   4.000000
mean   4.500000   5.500000   6.500000
std    3.872983   3.872983   3.872983
min    0.000000   1.000000   2.000000
25%    2.250000   3.250000   4.250000
50%    4.500000   5.500000   6.500000
75%    6.750000   7.750000   8.750000
max    9.000000  10.000000  11.000000

In [117]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [118]:
frame.mean(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         3   4        5
2         6   7        8

In [119]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [120]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
    'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
    'd': [0, 1, 2, 0, 1, 2, 3]})

frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [121]:
frame2=frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [122]:
frame.set_index(['c', 'd'], drop=False)    ## Toma las columnas c y d como índices. No elimina columnas c y d

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [123]:
frame2.reset_index()         ## Resetea el índice y lo regresa al índice original

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1